<?php
session_start();
include "header.php";
$successMessage = $_SESSION['success_message'] ?? '';
$errorMessage = $_SESSION['error_message'] ?? '';
unset($_SESSION['success_message'], $_SESSION['error_message']);
?>
<main>
  <section class="hero">
    <div class="container">
      <h2>Проектирование домов и коттеджей в Челябинске</h2>
      <div class="buttons">
        <a href="#stages" class="btn">Подробнее</a>
        <a href="#consultation" class="btn">Получить консультацию</a>
      </div>
    </div>
  </section>
</main>
<body>
  <div class="points">
    <div class="column">
      <img src="app/assets/img/icons/globe.png" alt="Globe icon">
      <p>Работаем во всех регионах России</p>
    </div>
    <div class="column">
      <img src="app/assets/img/icons/message.png" alt="Message icon">
      <p>Квалифицированная консультация бесплатно</p>
    </div>
    <div class="column">
      <img src="app/assets/img/icons/medal.png" alt="Medal icon">
      <p>Более 5 лет на рынке, около 80 выполненных проектов</p>
    </div>
  </div>
  <div class="text">
    <h2>Наша компания</h2>
    <p>Наша компания имеет многолетний опыт по проектированию домов, коттеджей, бань, гаражей в Челябинске и регионах. Для своих заказчиков мы предлагаем индивидуальное проектирование жилых домов, которое позволит выполнить проект дома исключительно по вашим требованиям, а также готовые проекты домов. Они разработаны для климатических условий Челябинской области. Такой вариант позволит сэкономить Вам время и деньги.</p>
    <h2 id="stages">Основные этапы проектирования</h2>
    <p>Строительство собственного дома это серьезный шаг, воплощение в жизнь которого требует большой подготовки. Первым и наиболее важным будет подготовка проекта будущего дома. Наличие проекта дома позволит строителям выполнить свою работу грамотно, а Заказчику сохранит нервы и деньги.</p>
    <p>Проектирование частных домов и коттеджей включает в себя несколько этапов работ:</p>
  </div>
  <div class="stages-container hidden">
    <div class="stages left">
      <p id="themes">1. Эскизное проектирование</p>
      <p>После подписания технического задания начинается работа архитекторов компании по созданию Эскизного проекта коттеджа. Эскизное проектирование включает в себя разработку планировок будущего дома и оформление внешнего вида. Помимо этого проект дома привязывается на участок земли, на котором он будет построен. В комплект чертежей этого раздела входят:</p>
    </div>
    <div class="stages right">
      <ul>
        <li>генплан участка</li>
        <li>схема инженерных сетей;</li>
        <li>планы этажей с размерами;</li>
        <li>планы этажей с мебелью;</li>
        <li>разрез;</li>
        <li>фасады (4 шт.);</li>
        <li>видовые кадры дома(4 шт.).</li>
      </ul>
    </div>
  </div>
  <div class="stages-container hidden">
    <div class="stages left">
      <p id="themes">2. Архитектурно-строительное проектирование</p>
      <p>После согласования Эскизного проекта начинается работа в рамках следующего этапа: проектирование архитектурно-строительного раздела. При проектировании дома инженеры разрабатывают для Вас проект, который будет соответствовать всем строительным нормам и правилам.В комплект чертежей для строительства коттеджа входят:</p>
    </div>
    <div class="stages right">
      <ul>
        <li>конструкции фундаментов</li>
        <li>кладочные планы;</li>
        <li>планы перекрытий;</li>
        <li>разрезы;</li>
        <li>узлы опирания;</li>
        <li>чертежи по кровле;</li>
        <li>спецификации по материалам.</li>
      </ul>
    </div>
  </div>
  <div class="stages-container hidden">
    <div class="stages left">
      <p id="themes">3. Проектирование инженерных сетей дома</p>
      <p>Помимо архитектурно-строительного проектирования готовы предоставить заказчику услуги по проектированию инженерных систем коттеджей:</p>
    </div>
    <div class="stages right">
      <ul>
        <li>конструкции фундаментов</li>
        <li>проект электроснабжения дома;</li>
        <li>проект вентиляции и отопления дома (раздел ОВ);</li>
        <li>проект водоснабжения и канализации дома (раздел ВК).</li>
      </ul>
    </div>
  </div>
  <div class="text">
    <p>После окончания проектирования мы предлагаем нашим Заказчикам авторский надзор за проектом. Выбирая эту услугу Вы гарантируете себе точное соблюдение проекта строителями и оперативное решение задач вместе с проектировщиком на строительной площадке.</p>
    <p>Проектирование загородных домов и коттеджей - это задача, с которой мы справляемся на отлично не первый год.</p>
    <button id="projects-button" onclick="window.location.href='catalog.php'">Наши проекты</button>
  </div>
  <div class="question" id="q1">
    <h3>Какие документы нужны для проектирования дома?<span>+</span></h3>
    <div class="answer">
      <p>Ответ: Для того, чтобы начать работу от Вас потребуются паспорт (для заключения договора), кадастровый номер участка. Также желательно иметь отчет о геологических изысканиях для Вашего участка, чтобы принять тип фундамента и выполнить его расчет.</p>
    </div>
  </div>
  <div class="question" id="q2">
    <h3>Какой срок проектирования дома?<span>+</span></h3>
    <div class="answer">
      <p>Ответ: Срок проектирования в среднем составляет 1-1,5 месяца. Это стандартный проект для дома площадью до 150-250 м2, включающий Эскизный проект (раздел Архитектурные решения) и Рабочий проект (Конструктивные решения или Архитектурно-строительный раздел). В зависимости от сложности и объема проектирования, например, разработка Инженерных сетей (Отопление и вентиляция ОВ, Водоснабжение и канализация ВК, Электроснабжение ЭОМ), срок проектирования может увеличиться до 2-2,5 месяцев.</p>
    </div>
  </div>
  <div class="question" id="q3">
    <h3>Сколько стоит проект дома 200 кв.м?<span>+</span></h3>
    <div class="answer">
      <p>Ответ: Стандартный пакет разделы Архитектурные решения и Конструктивные решения (или по-другому Архитектурно-строительный раздел) будет стоить 50 000 - 60 000 рублей. Если у Вас имеются планировки или эскизы проекта, найденные в интернете, можно ограничиться строительным разделом. В таком случае проект обойдется Вам примерно в 40 000 рублей. Точную стоимость проекта и объем работ лучше обсуждать при встрече.</p>
    </div>
  </div>
  <div class="question" id="q4">
    <h3>Можно ли построить дом без проекта?<span>+</span></h3>
    <div class="answer">
      <p>Ответ: Построить конечно можно. Но имея на руках проект прежде всего Вы экономите свои время, деньги и нервы. В проекте рассчитаны все необходимые для строительства материалы, и Вы можете быть уверены, что подрядчик не обманет заказав слишком много, например, бетона или блока. Без проекта горе-строители вытворяют такое, что страшно и смотреть. И потом Вам придется доплачивать уже другим строителям, чтобы это исправить, и как правило, это выходит гораздо дороже.</p>
    </div>
  </div>
  <div class="question" id="q5">
    <h3>Есть ли готовые проекты домов?<span>+</span></h3>
    <div class="answer">
      <p>Ответ: За все время работы мы разработали более 200 проектов, которые, если устроят планировки и внешний вид, Вы можете приобрести. На нашем сайте представлена часть готовых проектов. Вы можете написать или позвонить и заказать каталог на электронную почту. Если Вы выбрали из готовых проектов то, что вам нужно мы подготовим привязку здания конкретно на Ваш участок и распечатаем проект. При необходимости в планировки готов ых проектов можно внести корректировки.</p>
    </div>
  </div>
  <div class="question" id="q6">
    <h3>Я не хочу тратиться на проект<span>+</span></h3>
    <div class="answer">
      <p>Ответ: У нас для вас хорошие предложения на строительство, материалы. Стоимость проекта составляет всего 1-2% от стоимости строительства здания. Согласитесь, это незначительные траты в общем объеме. Проект позволит вам сэкономить деньги, время и, самое главное, Ваше здоровье. Вы закончите строительство в срок и без лишних нервов.</p>
    </div>
  </div>
  <div class="question" id="q7">
    <h3>У конкурентов дешевле<span>+</span></h3>
    <div class="answer">
      <p>Ответ: При встрече в нашем офисе мы предоставим Вам примеры проектов, по которым сможете оценить качество проработки проекта. Вы убедитесь, что конкуренты не предлагают того, что предлагаем мы. За 9 лет проектирования мы успешно реализовали более 350 проектов.</p>
    </div>
  </div>
  <div class="question" id="q8">
    <h3>Нужен ли строителям проект?<span>+</span></h3>
    <div class="answer">
      <p>Ответ: Строители делают расчёт количества материалов «на коленке», мы же рассчитаем с точностью до м3, м2. Многие детали заранее учесть невозможно, проект же от этого избавит. Встречаются застройщики, которые считают, что достаточно рассказать строителю какой он хочет дом, и прораб или бригадир сможет легко по бумажке построить здание, посчитать на коленке объемы материалов для стройки, и тем самым сэкономить на проекте. Но часто к нам приходят люди, которым такие бригады построили совсем не то, что представлял застройщик, или уже после постройки здания почему-то появились трещины в фундаментах и стенах. Приходится проводить обследование, делать проект реконструкции или усиления конструкций, и тратить еще больше денег. Наша задача сэкономить Ваше время и здоровье. Заказав проект у нас, мы предоставим проект, по которому любой грамотный строитель сможет построить именно такой дом, о котором Вы мечтали в срок и без лишних нервов. В проекте будут даны все объемы используемых материалов, узлы и рекомендации к производству работ. Вам не придется контролировать процесс, а спокойно наблюдать за ходом строительства.</p>
    </div>
  </div>
  <div class="consultation-form" id="consultation">
    <form id="consultationForm">
        <h2>Бесплатная консультация</h2>
        <div id="alertMessage"></div>
        <div>
            <input type="text" name="name" placeholder="Ваше имя" required />
            <input type="email" name="mail" placeholder="E-mail" required />
            <input type="tel" id="phone" name="phone" placeholder="Телефон" required />
        </div>
        <textarea name="message" placeholder="Ваше сообщение" required></textarea>
        <br>
        <button type="submit">Отправить</button>
        <p>Нажимая на кнопку «Отправить», я даю согласие на обработку персональных данных</p>
    </form>
</div>
<script>
document.addEventListener('DOMContentLoaded', function() {
  const phoneInput = document.getElementById('phone');
  phoneInput.addEventListener('input', function(e) {
    let input = this.value.replace(/\D/g,'');
    if (input.startsWith('8')) {
      input = '7' + input.slice(1);
    } else if (input.startsWith('9')) {
      input = '7' + input;
    }
    if (input.length > 11) input = input.slice(0, 11);
    let formatted = '+';
    if (input.length > 0) {
      formatted += input[0];
    }
    if (input.length > 1) {
      formatted += ' (' + input.substring(1,4);
    }
    if (input.length >= 4) {
      formatted += ') ' + input.substring(4,7);
    }
    if (input.length >= 7) {
      formatted += '-' + input.substring(7,9);
    }
    if (input.length >= 9) {
      formatted += '-' + input.substring(9,11);
    }
    this.value = formatted;
  });
  const successMessage = "<?php echo addslashes($successMessage); ?>";
  const errorMessage = "<?php echo addslashes($errorMessage); ?>";
  document.getElementById('consultationForm').addEventListener('submit', function(event) {
    event.preventDefault();
    const formData = new FormData(this);
    fetch('app/submit_consultation.php', {
      method: 'POST',
      body: formData
    })
    .then(response => response.json())
    .then(data => {
      const alertMessage = document.getElementById('alertMessage');
      if (data.success) {
        alertMessage.innerHTML = `<div class="alert alert-success">${data.message}</div>`;
        this.reset();
      } else {
        alertMessage.innerHTML = `<div class="alert alert-danger">${data.message}</div>`;
      }
    })
    .catch(error => {
      console.error('Ошибка:', error);
      document.getElementById('alertMessage').innerHTML = `<div class="alert alert-danger">Ошибка на стороне сервера. Пожалуйста, попробуйте позже.</div>`;
    });
  });
});
</script>
</body>
<?php
include "footer.php";
?>